app/views/tweets/_form.html.erb

  ユーザーID
  <%= f.collection_select :user_id, User.all, :id, :id, {prompt: true}, {class: "form-control user-id-field"} %>
---
SELECT "users".* FROM "users"