app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    if
      @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test"], ["user_id", 1], ["created_at", "2017-02-12 04:51:55.237370"], ["updated_at", "2017-02-12 04:51:55.237370"]]

  def update
    if
      @tweet.update(tweet_params)
---
UPDATE "tweets" SET "content" = ?, "updated_at" = ? WHERE "tweets"."id" = ?