app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "oka"], ["email", "aaa@aaa.jp"], ["created_at", "2017-02-12 04:51:47.302288"], ["updated_at", "2017-02-12 04:51:47.302288"]]
---
  def create
    @user = User.new(user_params)

    file = params[:user][:image]
    @user.set_image(file)

    if @user.save

UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "face.jpg"], ["updated_at", "2017-02-12 09:53:24.251385"], ["id", 1]]
---
  def update

    file = params[:user][:image]
    @user.set_image(file)
    if @user.update(user_params)